**1.VİDEO**

In [2]:
import pandas as pd
import numpy as np

seri= pd.Series([1,2,3,4,5,6,7,8,9])
print(seri)
type(seri)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

pandas.core.series.Series

In [13]:
#.axes : Serinin start,stop, step değerlerini gösterir.
print(seri.axes)

#dtype(): Serinin veri tipini gösterir.
print(seri.dtype)

# .size: Eleman sayısı?
print(seri.size)

# .ndim: Kaç boyutlu?
print(seri.ndim)

# .values:
print(seri.values)

# .head(adet):  ilk adet kadar elemanı gösterir. Adet yazılmazsa ilk beş adeti verir.
print(seri.head())

# tail(): head in tam tersi
print(seri.tail())

[RangeIndex(start=0, stop=9, step=1)]
int64
9
1
[1 2 3 4 5 6 7 8 9]
0    1
1    2
2    3
3    4
4    5
dtype: int64
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [21]:
seri1= pd.Series([12,34,25,66,86],index=["a","b","c","d","e"])
print(seri1)

a    12
b    34
c    25
d    66
e    86
dtype: int64

In [30]:
print(seri1["a"])
print(seri1[["a","b"]])

12
a    12
b    34
dtype: int64

In [27]:
sözlük={"reg": 10, "log": 11, "cart": 12}
seri2=pd.Series(sözlük)
print(sözlük)
print(seri2)

{'reg': 10, 'log': 11, 'cart': 12}
reg     10
log     11
cart    12
dtype: int64

**2.VİDEO**

In [36]:
l= [1,2,3,4,5]
pd.DataFrame(l,columns= ["değisken_ismi"])

   değisken_ismi
0              1
1              2
2              3
3              4
4              5

In [40]:
m= np.arange(1,10).reshape(3,3)
df=pd.DataFrame(m, columns=["1","2","3"])
df.columns={"var1","var2","var3"}
df

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [60]:
s1=np.random.randint(10,size=5)
s2=np.random.randint(10,size=5)
s3=np.random.randint(10,size=5)

sözlük= {"var1": s1, "var2": s2, "var3": s3}
df=pd.DataFrame(sözlük)
df

   var1  var2  var3
0     4     0     0
1     0     0     7
2     5     3     3
3     9     7     1
4     6     5     5

In [61]:
df.index=["a","b","c","d","e"]
df

   var1  var2  var3
a     4     0     0
b     0     0     7
c     5     3     3
d     9     7     1
e     6     5     5

In [62]:
# .drop(): ile sütun veya satır silebiliriz.
# axis=1 ile ütun siler.
#axis=0 ile satır siler.

df.drop("var2",axis=1)

   var1  var3
a     4     0
b     0     7
c     5     3
d     9     1
e     6     5

In [68]:
df.drop("c",axis=0)

   var1  var2  var3
a     4     0     0
b     0     0     7
d     9     7     1
e     6     5     5

In [66]:
df

   var1  var2  var3
a     4     0     0
b     0     0     7
c     5     3     3
d     9     7     1
e     6     5     5

In [69]:
#inplace parametresi kullanarak değişiklikleri kalıcı hale getirebiliriz.

df.drop("c",axis=0,inplace=True)

In [85]:
df["sum"]= (df["var1"]+df["var2"]+df["var3"]) 
df

#Burada sum yerine ortalama almanın ve bunu mean gibi bi fonksiyonla satır satır yapmanın bir yolu var mı liderlere sor.

   var1  var2  var3  var4  sum
a     4     0     0     4    4
b     0     0     7     7    7
d     9     7     1    17   17
e     6     5     5    16   16

In [86]:
df.drop("var4",axis=1,inplace=True)
df

   var1  var2  var3  sum
a     4     0     0    4
b     0     0     7    7
d     9     7     1   17
e     6     5     5   16

**Gözlem ve Değişken Seçimi**

In [91]:
m=np.random.randint(1,50,size=(5,5))
df=pd.DataFrame(m,columns=[ "var1", "var2","var3", "var4","var5"])
df

   var1  var2  var3  var4  var5
0     6    21     1    47     4
1    35    25     6     6    22
2    19    24    40    36    34
3     9    46    35    43    15
4    15    43    44    24    32

In [92]:
# .loc: Tanımlandığı şekliyle seçim yapmak için kullanılır.
df.loc[0:3]

   var1  var2  var3  var4  var5
0     6    21     1    47     4
1    35    25     6     6    22
2    19    24    40    36    34
3     9    46    35    43    15

In [96]:
#iloc:alışık olduğumuz indexleme mantığıyla seçim yapmak için kullanılır.
df.iloc[0:3]

   var1  var2  var3  var4  var5
0     6    21     1    47     4
1    35    25     6     6    22
2    19    24    40    36    34

In [95]:
df.iloc[0,0]

6

In [97]:
df.iloc[:3,:4]

   var1  var2  var3  var4
0     6    21     1    47
1    35    25     6     6
2    19    24    40    36

In [100]:
df[df.var2 >22]

   var1  var2  var3  var4  var5
1    35    25     6     6    22
2    19    24    40    36    34
3     9    46    35    43    15
4    15    43    44    24    32

In [102]:
df.query("var1 > 15 & var3 < 15")

   var1  var2  var3  var4  var5
1    35    25     6     6    22

**Birleştirme join İşlemlerinde kaldım**